chartfinder-api/app/controllers/api/charts_controller.rb

  def index
    charts=Chart.all
---
SELECT "charts".* FROM "charts"

  def show
    if @chart
     render json: ChartSerializer.new(@chart).to_serialized_json
    else
      date_to_url(@date)
      songs = scrape(@url)
      chart = Chart.create(date: @date, country: "UK")
---
INSERT INTO "charts" ("date", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["date", "09-01-1999"], ["country", "UK"], ["created_at", "2020-08-09 10:28:14.641137"], ["updated_at", "2020-08-09 10:28:14.641137"]]

    def set_chart
      @date = params[:id].split("-").reverse.join("-")
      @chart = Chart.find_by(date: @date)
---
SELECT "charts".* FROM "charts" WHERE "charts"."date" = ? LIMIT ?  [["date", "11-08-1989"], ["LIMIT", 1]]

    def scrape(url)
      html = open(url)
      doc = Nokogiri::HTML(html)
      songs = doc.css("table.chart-positions div.track")
      @song_array = []

        position = 1
        songs.each do |song|
        new_hash = {}
        new_hash[:name] = song.css(".title a").text.split.map(&:capitalize).join(' ')
        new_hash[:artist] = song.css(".artist a").text.split.map(&:capitalize).join(' ')
        new_hash[:label] = song.css(".label").text.split.map(&:capitalize).join(' ')
        new_hash[:img_url] = song.css(".cover img").attribute("src").value
        new_hash[:position] = position
        position=position+1

        track = find_spotify_details(new_hash[:name])


        if track.first
          new_hash[:spotify_id]=track.first.id
          new_hash[:img_url] = track.first.album.images.first["url"]
        else
         new_hash[:spotify_id]= ""
        end

        @song_array << new_hash
---
INSERT INTO "songs" ("name", "artist", "img_url", "chart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def make_songs(songs, chart)
      songs.each do |song|
        @song = chart.songs.build(song)
        @song.save
---
INSERT INTO "songs" ("name", "artist", "img_url", "chart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)